#ifndef CSATASK1__RND_H_
#define CSATASK1__RND_H_

#include <cstdlib>

//------------------------------------------------------------------------------
// rnd.h - содержит генератор случайных чисел
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Генерация рандомного года в диапазоне от 1943 до 2020
inline auto RandomYear() {
  return rand() % 78 + 1943;
}

//------------------------------------------------------------------------------
// Генерация рандомного процента популярности в диапазоне от 1 до 100
inline auto RandomPerc() {
  return (float)rand()/RAND_MAX;
}

//------------------------------------------------------------------------------
// Генерация рандомного булевского значения в диапазоне от 0 до 1
inline auto RandomBool() {
  return rand() % 2;
}

#endif //CSATASK1__RND_H_
